{
	"projects": [
		{
			"name": "Restaurants BOS",
			"img": "img/restaurant_bos_project.PNG",
			"alt": "Restaurant BOS",
			"gitLink": "https://github.com/Ronald03/restaurant_catalog",
			"desc": "Designed a web based application fully responsive and mobile friendly to manage Restaurants and their corresponding menus. Configured a user registration and authentication system using one of the Google’s API. Signed users have the ability to post, edit, and delete restaurants and menu items. Used Flask and many of its libraries to create a complete and responsive web server in connection with the database.",
			"skills": ["Python","Flask","Javascript","HTML/CSS", "SQLAlchemy", "SQLite"]
		},
		{
			"name": "Movie Trailers",
			"img": "img/movie_trailer_project.PNG",
			"alt": "Movie trailers",
			"gitLink": "https://github.com/Ronald03/movie_trailers_website",
			"desc": "Wrote a server-side code on python to store a list of favorite movies, including box art imagery, movie trailer URL and storyline. Then use the code to generate a static and responsive web page to allow users to browse their movies and watch their trailers.",
			"skills": ["Python", "Flask", "Javascript", "HTML/CSS"]
		},
		{
			"name": "Log Analisys",
			"img": "img/project-code.jpg",
			"alt": "Photo by Dlanor S on Unsplash",
			"gitLink": "https://github.com/Ronald03/log_analysis",
			"desc": "Build an internal reporting tool with python that will use information from the database to discover what kind of articles the site's readers like. This reporting tool stablishes a connection between the python code and a PostgreSQL database to extract the data, once the program finishes executing it exports the result to a text file.",
			"skills": ["Python", "PostgreSQL"]
		}

	],
	"homeText": "I'm Ronald --  a full stack web developer who 
	enjoys from redeveloping a website to creating the 
	complex functionalities of web applications. I started 
	to code for fun and personal experience and now continue 
	to do it with passion and the desire to do great on every 
	project. I always look for my code to be Responsive with 
	mobile-oriented designs, Efficient and Scalable."
}
